Regression/presentation.tex
% Created 2012-03-27 Tue 15:09
\documentclass[bigger]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\mode<beamer>{\usetheme{Madrid}}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Inter-rater Reliability}
\author{Abram Hindle}
\date{2012-02-14 Tue}

\begin{document}

\maketitle

\begin{frame}
\frametitle{Outline}
\setcounter{tocdepth}{3}
\tableofcontents
\end{frame}




\section{Introduction}
\label{sec-1}
\begin{frame}
\frametitle{Imagine}
\label{sec-1-1}


\begin{itemize}
\item We're tagging or rating items
\begin{itemize}
\item commits
\item topics
\item bug reports
\end{itemize}
\item We're using multiple people to tag or rate these items
\item How do we ensure that we have agreement
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Example}
\label{sec-1-2}


\begin{itemize}
\item ``I made a change to the install documentation.''
\begin{itemize}
\item Is this a portability relevant commit message?
\end{itemize}
\item ``I made a change to the install documentation regarding OSX.''
\begin{itemize}
\item Is this a portability relevant commit message?
\end{itemize}
\item ``I made a change to the install documentation regarding OSX,
     Windows and Linux.''
\begin{itemize}
\item Is this a portability relevant commit message?
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{We can disagree}
\label{sec-1-3}


\begin{itemize}
\item With ratings this is a problem
\item Especially if we want to model or predict ratings
\item How random are the ratings?
\item Is there a bias?
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Reliability}
\label{sec-1-4}


\begin{itemize}
\item So how reliability are ratings.
\item Is there agreement?
\item What does lack of agreement mean?
\end{itemize}
\end{frame}
\section{Inter-rater reliability}
\label{sec-2}
\begin{frame}
\frametitle{How?}
\label{sec-2-1}


\begin{itemize}
\item We can measure correlation
\begin{itemize}
\item Not really meant for it, but a good start
\item \href{http://en.wikipedia.org/wiki/Pearson_product-moment_correlation_coefficient}{Pearson}
\item \href{http://en.wikipedia.org/wiki/Spearman%27s_rank_correlation_coefficient}{Spearman}
\end{itemize}
\item \href{http://en.wikipedia.org/wiki/Cohen%27s_kappa}{Cohen's Kappa} Statistic
\begin{itemize}
\item Good for 2 raters
\end{itemize}
\item \href{http://en.wikipedia.org/wiki/Fleiss%27_kappa}{Fleiss's Kappa}
\begin{itemize}
\item Good for more
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{R}
\label{sec-2-2}


\begin{itemize}
\item \href{http://en.wikipedia.org/wiki/Pearson_product-moment_correlation_coefficient}{Pearson}  cor(x,y,method=''pearson'')
\item \href{http://en.wikipedia.org/wiki/Spearman%27s_rank_correlation_coefficient}{Spearman} cor(x,y,method=''spearman'')
\item library(irr)
\item columns of a matrix
\item kappa2(yourMatrix)
\item kappm.fleiss(yourMatrix)
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{R}
\label{sec-2-3}


\begin{itemize}
\item Go and look at the code
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{What's a good Kappa or Correlation?}
\label{sec-2-4}


\begin{itemize}
\item 1 is good
\item 0 or worse is bad
\item 0.1 will get reviewers annoyed
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Pay attention to}
\label{sec-2-5}


\begin{itemize}
\item \# raters
\item \# subjects
\item Kappa
\item p-value
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Threats to IRR}
\label{sec-2-6}


\begin{itemize}
\item Kappa of all same rank is NaN
\item Lack of range in ratings 0,1 versus 1-5
\item Class imbalance, if 10\% is rated one way this can cause a problem
\end{itemize}
\end{frame}

\end{document}
